/*********************************************
 * OPL 12.6.3.0 Model
 * Author: 2966334821
 * Creation Date: 2022-1-14 at 下午10:32:18
 *********************************************/
 // 1.定义决策变量          五种饲料 数值非负
 dvar float+ x1;
 dvar float+ x2;
 dvar float+ x3;
 dvar float+ x4;
 dvar float+ x5;
 
 // 2.定义目标函数  
 minimize 0.2*x1+0.7*x2+0.4*x3+0.3*x4+0.8*x5;
 
 
 // 3.定义约束条件
 subject to {
 	 // 蛋白质 
 	 3*x1+2*x2+1*x3+6*x4+18*x5>=700;
 	 // 矿物质
 	 1*x1+0.5*x2+0.2*x3+2*x4+0.5*x5>=30;
 	 // 维生素
 	 0.5*x1+1*x2+0.2*x3+2*x4+0.8*x5>=100;
 	 //x1~x5限制在定义时已写，此处不赘述
 }